<template>
	<div class="home" style="text-align:left">
		<h2>Структуры данных</h2>
		<p>Для работы с данными выбрал Vuex. Он схож с привычным мне mobx/mobx-state-tree.</p>
		<p>Для работы с данными создавал отдельные модули (namespaced: true) внутри Vuex store.</p>
		<p>Активно использовался createNamespacedHelpers.</p>
		<p>Обновлял данные через только actions. Была возможность это делать напрямую через mutations, но мне показалось что выбранный мной вариант более декларативен и подходит для любых ситуаций. В том числе и для асинхронных действий. </p>
		<p>Логику шаблонов и стилей почти везде вынес в отдельные файлы. Это улучшает читабельность кода.</p>
		<p>Роутер подгружает страницы по мере надобности. Используются webpack chunks.</p>
		<p>При обновлении вложенных структур данных использовал Vue.set</p>

		<h2>Interactive desktop</h2>
		<a target="blank" href="https://www.npmjs.com/package/element-resize-event">element-resize-event</a>
		<p>Аналог [vue-element-resize-event] работает некорректно и очень мало скачиваний.</p>
		<a target="blank" href="https://www.npmjs.com/package/vuedraggable">vuedraggable</a>
		<p>Мне этот модуль показался удобным и простым в использовании. Но так как у меня еще мало опыта с выбором модулей под Vue.js, мой выбор может быть неоптимальным.</p>

		<h2>Transactions</h2>
		<p>Для написания данного компонента дополнительных модулей не потребовалось.</p>

		<h2>Big table</h2>
		<p>Отдельное тестовое задание, которое мне когда-то высылали. Решил его сделать когда учил Vue.js</p>
		<p>Нужно было создать большую таблицу размером 40000х40000 (1 600 000 000 ячеек). В каждой ячейке инпут в который можно записать значение. Заданное значение сохраняется в таблице.</p>
	</div>
</template>

